Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/claiming_a_social_welfare_payment/replacing_a_social_welfare_payment_book_or_social_services_card.html.txt.tmx
Source language: en
Languages: ga

source: How social welfare payments are paid
ga: Athsholáthar leabhar leasa shóisialaigh nó Cárta Seirbhísí Sóisialacha

source: If you live in Ireland and are getting a social welfare payment, you can request the method by which you are paid
ga: Má chónaíonn tú in Éirinn agus má tá íocaíocht leasa shóisialaigh á fáil agat, féadfaidh tú an modh a íoctar thú a iarraidh

source: • By Electronic Funds Transfer (EFT): your social welfare payment is paid directly into your personal account at a bank, building society or at certain credit unions
ga: Cinntí riaracháin a bhíonn i gceist leis na cinntí a dhéantar ar an rogha modh íocaíochta laistigh den Roinn Coimirce Sóisialaí

source: DSP will decide if you can be paid by EFT
ga: Tá 3 modh íocaíochta éagsúla ann:

source: • By cash in your local post office: you will need a Public Services Card or Social Services Card for identification to collect cash payments at your local post office
ga: • Airgead i d’oifig poist áitiúil: Is féidir Cárta Seirbhísí Leasa Shóisialaigh (SWS) ar mhaithe le cúrsaí aitheantais a úsáid chun íocaíochtaí airgid a bhailiú ag d'oifig poist áitiúil

source: If using an SSC, you will also require photo ID
ga: Cuirtear an Cárta Seirbhísí Poiblí in ionad an SWS

source: • By cheque: your social welfare payment cheque can be cashed in your local post office or lodged to an account in a financial institution
ga: • Seic • Ríomhaistriú Airgid: íocaíocht leasa shóisialaigh a íoctar díreach isteach i do chuntas bainc

source: Social welfare payments are no longer paid using a book of payable orders that you can cash at your local post office
ga: Ní íoctar íocaíochtaí leasa shóisialaigh trí leabhar pá-orduithe le briseadh ag d'oifig poist áitiúil a thuilleadh
